

if __name__ == '__main__':
    passtimelable = ['报修时间', '到达现场时间', '故障排除时间']
    uselable = ['报修类型','设备系统','位置']
    meslable = ['报修描述','修复状态','报修处理情况','故障类','详细措施','设备']
    system1able = ['中航信离港系统(T1)',  'T1航显系统','T1视频监控系统','工作人员通道人脸识别系统(T1)', 'T1行李系统', 'T1桥载空调', 'T1广播系统','T1登机桥', '内通系统(T1)', 'T1综合布线系统','T1出入口控制系统','泊位引导系统(T1)', 'T1桥载电源', '有线电视系统(T1)', 'T1网络','航班查询系统(T1)', 'T1离港网络', 'T1云平台系统','机坪道口车辆识别系统(T1)', 'T1主网']
    system2lable = ['T2出入口控制系统','内通系统(T2)','T2广播系统','T2航显系统','T2视频监控系统','工作人员通道人脸识别系统(T2)','T2时钟系统','T2东交视频监控系统','有线电视系统(T2)','T2综合布线系统','T2大屏显示系统','T2网络','T2离港网络','T2网络系统']
    system2mod = ['中航信离港系统(T2)','T2出入口控制系统','内通系统(T2)','T2广播系统','T2航显系统','T2视频监控系统','工作人员通道人脸识别系统(T2)','T2时钟系统','T2网络系统','T2东交视频监控系统','有线电视系统(T2)','T2综合布线系统','T2大屏显示系统','T2网络','T2离港网络']
    # '办公自动化系统','全景视频监控系统', '精密空调','云桌面系统','无线对讲机系统,'SITA离港系统'
    print(f'系统总数{len(system2mod)}')
    # 默认词条:时间标签 使用数据标签  详细数据标签
    excelLable = {'timelables':timelable,'uselables':uselable,'meslables':meslable}
    # EA = excelAZ(r'C:\Users\ASUS\Desktop\TX0712.xlsx',excelLable)
    pass